// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QLayout>

#include "_srv/Srv/dbg.h"

#include "ui_WBox.h"
#include "WBox.h"

// Добавить плашку. -------------------------------------------------------------
//------------------------------------------------------------------------------
void WBox::addPlate(WClr *plate) {
    (plate->isFixed() ? ui->lyFix : ui->lyStd)->insertWidget(0, plate);

    FNC << ui->lyFix->count();


//    QObjectList cld = ui->lyStd->children();
//    while(cld.size() > this->size) { cld.last()->deleteLater(); }

    connect(plate, &WClr::remove, this, &WBox::remove_clr);
    connect(plate, &WClr::change_fix, this, &WBox::chahge_fix);
}// addPlate

// Удалить контрол. ------------------------------------------------------------
//------------------------------------------------------------------------------
void WBox::remove_clr(WClr *clr) { delete clr; }

// Изменение фиксации. ---------------------------------------------------------
//------------------------------------------------------------------------------
void WBox::chahge_fix(WClr *clr) {
    (clr->isFixed() ? ui->lyFix : ui->lyStd)->insertWidget(0, clr);
}// chahge_fix

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
WBox::WBox(QWidget *parent) : QWidget(parent), ui(new Ui::WBox) {
    ui->setupUi(this);

}// WBox

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
WBox::~WBox() {
    delete ui;
}//~WBox

//------------------------------------------------------------------------------

