// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QTimer>
#include "WaitForSignal.h"


/* WaitForSignalHelper. *******************************************************/
/******************************************************************************/

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
WaitForSignal::WaitForSignal(QObject *object, const char *signal) : tout(false)
    { connect(object, signal, &eloop, SLOT(quit())); }

// Ожидание прихода сигнала. ---------------------------------------------------
//------------------------------------------------------------------------------
bool WaitForSignal::wait(int timeoutMs) {
    QTimer tmr;
    if(timeoutMs != 0) {
        connect(&tmr, &QTimer::timeout, this, &WaitForSignal::timeout);
        tmr.setInterval(timeoutMs); tmr.start();
    }// if(timeoutMs != 0)

    tout = false; eloop.exec();
    return !tout;
}// wait;

// СЛОТ: Время вышло. ----------------------------------------------------------
//------------------------------------------------------------------------------
void WaitForSignal::timeout(void) { tout = true; eloop.quit(); }

//------------------------------------------------------------------------------


