#ifndef WGT_H
#define WGT_H

/* Библиотека работы с виджетами. *********************************************/
/******************************************************************************/

// INCLUDE ---------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QWidget>


/* Макросы ********************************************************************/
/******************************************************************************/
#define SELECT_ROW(v, r) do { v->selectRow(r); v->scrollTo(v->currentIndex()); } while(false)
#define TO_CENTER(r) this->move(r.center() - this->rect().center())
#define DESKTOP qApp->desktop()->availableGeometry(this)

#define ACCEPT QDialog::Accepted
#define REJECT QDialog::Rejected

// Убрать все элементы из layout. ----------------------------------------------
//------------------------------------------------------------------------------
void clearLayout(QLayout *ly);


//------------------------------------------------------------------------------
#endif // WGT_H
