// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QMessageBox>
#include <QTime>

#include "_srv/Srv/dbg.h"
#include "_srv/Srv/std.h"

#include "ui_FMain.h"
#include "FMain.h"
#include "WAttention.h"


// Глобальные переменные. ------------------------------------------------------
//------------------------------------------------------------------------------
extern FMain *fmMain;
extern WAttention *wgAttention;

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
FMain::FMain(QWidget *parent) : QMainWindow(parent), ui(new Ui::FMain) {

    // Внешний вид.
    ui->setupUi(this);

    //Регистрация глобальной горячей клавиши (WinAPI).
    this->hkAct = new QGlobalShortcut(this);
    this->hkAct->setShortcut(QKeySequence("Alt+E"));

    // Подключение сигналов/слотов.
    connect(this->hkAct, &QGlobalShortcut::activated, this, &FMain::global_hk);

}// FMain

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
FMain::~FMain() {
    delete ui;
}// ~FMain

// Файл -> Выход. --------------------------------------------------------------
//------------------------------------------------------------------------------
void FMain::on_aExit_triggered() {
    if(QMessageBox::Yes == QMessageBox::question(
        this, "Подтверждение.", "Действительно выйти ?"
      , QMessageBox::Yes | QMessageBox::No ))
    { QApplication::quit(); }
}// on_aExit_triggered

// Отладка -> Проба. -----------------------------------------------------------
//------------------------------------------------------------------------------
void FMain::on_aTest_triggered() {
    DBG << R"(/bgn)";

    DBG << R"(\end)";
}// on_aTest_triggered

// Добавить. -------------------------------------------------------------------
//------------------------------------------------------------------------------
void FMain::on_btAdd_clicked() {
    wgAttention->show();
}// on_btAdd_clicked

// Срабатывание глобальной горячей клавиши. ------------------------------------
//------------------------------------------------------------------------------
void FMain::global_hk(void) {
    DBG << "global_hk ok";
}// global_hk

/*
// Нативный поток событий. -----------------------------------------------------
//------------------------------------------------------------------------------
bool FMain::nativeEvent(const QByteArray &type, void *message, long*) {
    if(type != "windows_generic_MSG") { return false; }

    return false;
}// nativeEvent
*/


//------------------------------------------------------------------------------

