#ifndef FPROC_H
#define FPROC_H

// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QWidget>
#include <QProcess>


// NAMESPACE. ------------------------------------------------------------------
//------------------------------------------------------------------------------
namespace Ui { class FProc; }

/* Запуск процессов через консорль. *******************************************/
/******************************************************************************/
class FProc : public QWidget {
    Q_OBJECT

public:
    explicit FProc(QWidget *parent = nullptr);
            ~FProc();

private slots:
    void on_btStart_clicked();

private:
    Ui::FProc *ui;
    QProcess *prc;

};// FProc

//------------------------------------------------------------------------------
#endif // FPROC_H
