#ifndef WSOUND_H
#define WSOUND_H

// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QWidget>

// NAMESPACE. ------------------------------------------------------------------
//------------------------------------------------------------------------------
namespace Ui { class WSound; }

/* Виджет работы со звуком. ***************************************************/
/******************************************************************************/
class WSound : public QWidget {
    Q_OBJECT

public:
    explicit WSound(QWidget *parent = 0);
            ~WSound();

private slots:
    void on_btFile_clicked();
    void on_btProc_clicked();

private:
    Ui::WSound *ui;
};// WSound

//------------------------------------------------------------------------------
#endif // WSOUND_H
