#include <QApplication>

#include "FMain.h"


// Глобальные переменные. ------------------------------------------------------
//------------------------------------------------------------------------------
FMain *fmMain;

// Главная функция. ------------------------------------------------------------
//------------------------------------------------------------------------------
int main(int argc, char *argv[]) {
    QApplication app(argc, argv);

    FMain _fmMain; fmMain = &_fmMain;
    fmMain->show();

    return app.exec();
}// main

//------------------------------------------------------------------------------
