#include <functional>

#include "ui_WLog.h"
#include "WLog.h"

// Очистить лог. ---------------------------------------------------------------
//------------------------------------------------------------------------------
void  WLog::clr(void) { ui->pt->clear(); }

// Запись об ошибке (ВСЕГДА). --------------------------------------------------
//------------------------------------------------------------------------------
void WLog::err(QString msg) { add(msg, Qt::red); }

// Оповещение (только в активный). ---------------------------------------------
//------------------------------------------------------------------------------
void WLog::inf(QString msg) { if(this->isVisible()) add(msg); }

// Добавить запись в лог. ------------------------------------------------------
//------------------------------------------------------------------------------
void WLog::add(QString msg, QColor clr) {
    static const QString BR = "<br>";
    auto MSG = [&]() -> QString {
        return "<h style='color:" + clr.name() + ";'>" + msg + "</h>"; };

    if(normal) { ui->pt->appendHtml(MSG()); }
    else       { ui->pt->cursorForPosition(QPoint(0, 0)).insertHtml(MSG()+BR); }
}// add

// Добавить как текст. ---------------------------------------------------------
//------------------------------------------------------------------------------
void WLog::addPlainText(QString msg) {
    static const QString NS = "\n";
    auto MSG = [&]() -> QString { return msg; };

    if(normal) { ui->pt->appendPlainText(MSG());
    } else     { ui->pt->cursorForPosition(QPoint(0, 0)).insertText(MSG()+NS); }
}// addPlainText

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
WLog::WLog(QWidget *parent) : QWidget(parent), ui(new Ui::WLog) {
    ui->setupUi(this);
}

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
WLog::~WLog() { delete ui; }

//------------------------------------------------------------------------------
