// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QApplication>

#include "FMain.h"

// Глобальные переменные. ------------------------------------------------------
//------------------------------------------------------------------------------
static FMain *fmMain = nullptr;

// Главная функция. ------------------------------------------------------------
//------------------------------------------------------------------------------
int main(int argc, char *argv[]) {

    QApplication app(argc, argv);

    QCoreApplication::setApplicationName("medium");
    QCoreApplication::setApplicationVersion("0.01");

    FMain _fmMain; fmMain = &_fmMain;

    return app.exec();
}// main

//------------------------------------------------------------------------------

