// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QApplication>
#include <QString>

#include "FMain.h"

// Глобальные переменные. ------------------------------------------------------
//------------------------------------------------------------------------------
int MAX_NUM = 4, TARGET = 0;

QString BCG("background-color:"), CLR("color:");
QString RED("red"), GRN("green"), BLU("blue");

FMain *fmMain;

// Главная функция. ------------------------------------------------------------
//------------------------------------------------------------------------------
int main(int argc, char *argv[]) {
    QApplication app(argc, argv);

    FMain _fmMain; fmMain = &_fmMain;
    fmMain->show();

    return app.exec();
}// main

//------------------------------------------------------------------------------
