#include "dbg.h"

#include "WBrd.h"
#include "ui_WBrd.h"

/* WBrd. **********************************************************************/
/******************************************************************************/

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
WBrd::WBrd(QWidget *parent) : QWidget(parent), ui(new Ui::WBrd) {

    // Внешний вид.
    ui->setupUi(this);

    // Скроллинг.
    this->box = new QWidget(this);
        this->box->setSizePolicy(QSizePolicy::Minimum, QSizePolicy::Fixed);
    QVBoxLayout *ly = new QVBoxLayout(this->box);
        ly->setContentsMargins(0, 0, 0, 0);
        ly->setSpacing(2);
    ui->sa->setWidget(this->box);

}// WBrd

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
WBrd::~WBrd() {
    delete ui;
    FNC << "end";
}//~WBrd

//------------------------------------------------------------------------------

