// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include <QStringList>

#include "ui_WSel.h"
#include "WSel.h"

#include "_srv/dbg.h"

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
WSel::WSel(QWidget *parent) : QWidget(parent), ui(new Ui::WSel) {

    // Внешний вид.
    ui->setupUi(this);

    // Инициализация.
    connect(ui->ls, &QListWidget::doubleClicked, this, &WSel::selected);

}// WSel

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
WSel::~WSel() {
    delete ui;
}// ~WSel

// Выбор элемента (событие). ---------------------------------------------------
//------------------------------------------------------------------------------
void WSel::selected(const QModelIndex &idx) {
    DBG << "data:" << idx.data();
}// selected

// Выбор элемента (вызов). -----------------------------------------------------
//------------------------------------------------------------------------------
bool WSel::sel(QMap<QWidget*, QString> *map) {
    this->show();
    this->setAttribute(Qt::WA_ShowModal, true);

    ui->ls->clear();
    this->map = map;
    ui->ls->insertItems(0, map->values());
}// sel

//------------------------------------------------------------------------------
