// INCLUDE. --------------------------------------------------------------------
//------------------------------------------------------------------------------
#include "dbg.h"

#include "ui_DSel.h"
#include "DSel.h"

// Конструктор. ----------------------------------------------------------------
//------------------------------------------------------------------------------
DSel::DSel(QWidget *parent) : QDialog(parent), ui(new Ui::DSel) {

    // Внешний вид.
    ui->setupUi(this);

    // Инициализация.
    connect(ui->ls, &QListWidget::itemActivated, this, &DSel::selected);

}// DSel

// Показ формы. ----------------------------------------------------------------
//------------------------------------------------------------------------------
void DSel::showEvent(QShowEvent *evt) {
    Q_UNUSED(evt);
    if(ui->ls->count() > 0 ) { ui->ls->setCurrentRow(0); }
    ui->ls->setFocus();


}// showEvent

// Деструктор. -----------------------------------------------------------------
//------------------------------------------------------------------------------
DSel::~DSel() {
    delete ui;
}// ~DSel

// Выбор элемента (событие). ---------------------------------------------------
//------------------------------------------------------------------------------
void DSel::selected(QListWidgetItem *item) {
    this->key = item->data(Qt::UserRole);
    FNC << "ok";
}// selected

// Выбор элемента (вызов). -----------------------------------------------------
//------------------------------------------------------------------------------
int DSel::sel(QMap<QVariant, QString> *map) {
    ui->ls->clear(); this->map = map;

    for(QVariant var: this->map->keys()) {
        QListWidgetItem *item = new QListWidgetItem(map->value(var));
        item->setData(Qt::UserRole, var);
        ui->ls->addItem(item);
    }// wgt

    return this->exec();
}// sel

//------------------------------------------------------------------------------
